rule APT34_Updated_Toolset_Intezer {
  meta:
    author = "Edwin Betancourth"
    description = "Detects TTPs and IOCs associated with an Iranian campaign by APT34 (OilRig) as described in an Intezer blog post. The campaign utilizes malicious documents, updated backdoors like SideTwist, and DNS tunneling for C2 communication."
    severity = "HIGH"
    priority = "HIGH"
    mitre_attack_tactic = "TA0011, TA0007, TA0002"
    mitre_attack_technique = "T1566.001, T1071.004, T1547.001"

  events:
    // Event 1: Malicious local activity (file creation/modification OR process launch)
    (
      // File-based indicators
      (
        (
          $activity.metadata.event_type = "FILE_CREATION" or
          $activity.metadata.event_type = "FILE_MODIFICATION"
        ) and
        (
          $activity.principal.process.file.sha256 = "c10cd1c78c180ba657e3921ee9421b9abd5b965c4cdfaa94a58e383b45bb72ca" or
          $activity.principal.process.file.sha256 = "4c323bc11982b95266732c01645c39618550e68f25c34f6d3d79288eae7d4378" or
          $activity.principal.process.file.sha256 = "a897164e3547f0ce3aaa476b0364a200769e8c07ce825bcfdc43939dd1314bb1" or
          $activity.principal.process.file.sha256 = "20b3d046ed617b7336156a64a0550d416afdd80a2c32ce332be6bbfd4829832c" or
          $activity.principal.process.file.sha256 = "d61eecd7492dfa461344076a93fc2668dc28943724190faf3d9390f8403b6411" or
          $activity.principal.process.file.sha256 = "47d3e6c389cfdbc9cf7eb61f3051c9f4e50e30cf2d97499144e023ae87d685d5" // SideTwist backdoor
        )
      )
      or
      // Process-based indicators
      (
        $activity.metadata.event_type = "PROCESS_LAUNCH" and
        (
          $activity.principal.process.file.full_path = /clientupdate\.exe/ or
          $activity.principal.process.command_line = /Job-Details\.doc/
        )
      )
    )
    $hostname = $activity.principal.hostname

    // Event 2: Network communication to known C2 domains
    (
      $network.metadata.event_type = "NETWORK_DNS" and
      (
        $network.network.dns.questions.name = /manygoodnews\.com/ or
        $network.network.dns.questions.name = /sarmsoftware\.com/
      )
    )
    $hostname = $network.principal.hostname

  match:
    $hostname over 5m

  condition:
    $activity and $network
}
